In [1]:
import pandas as pd

In [2]:
bank = pd.read_csv('Bank customers.csv')

In [3]:
bank.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,...,1,3,12691.0,777,11914.0,1.335,1144,42,1.625,0.061
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,...,1,2,8256.0,864,7392.0,1.541,1291,33,3.714,0.105
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,...,1,0,3418.0,0,3418.0,2.594,1887,20,2.333,0.000
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,...,4,1,3313.0,2517,796.0,1.405,1171,20,2.333,0.760
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,...,1,0,4716.0,0,4716.0,2.175,816,28,2.500,0.000

In [4]:
bank['Card_Category'].value_counts()

Card_Category
Blue        9436
Silver       555
Gold         116
Platinum      20
Name: count, dtype: int64

In [ ]:
bank.shape

(10127, 21)

In [ ]:
bank.isnull().sum()

CLIENTNUM                   0
Attrition_Flag              0
Customer_Age                0
Gender                      0
Dependent_count             0
Education_Level             0
Marital_Status              0
Income_Category             0
Card_Category               0
Months_on_book              0
Total_Relationship_Count    0
Months_Inactive_12_mon      0
Contacts_Count_12_mon       0
Credit_Limit                0
Total_Revolving_Bal         0
Avg_Open_To_Buy             0
Total_Amt_Chng_Q4_Q1        0
Total_Trans_Amt             0
Total_Trans_Ct              0
Total_Ct_Chng_Q4_Q1         0
Avg_Utilization_Ratio       0
dtype: int64

In [ ]:
bank[['Gender','Credit_Limit']].groupby("Gender").agg(['mean', 'count'])

        Credit_Limit
                mean count
Gender
F        5023.854274  5358
M       12685.674963  4769

In [ ]:
bank[['Gender','Avg_Utilization_Ratio']].groupby("Gender").agg(['mean', 'count'])

       Avg_Utilization_Ratio
                        mean count
Gender
F                   0.341957  5358
M                   0.199548  4769

In [ ]:
bank_cards = bank.groupby("Card_Category")
bank_cards['Customer_Age'].max()

Card_Category
Blue        73
Gold        63
Platinum    56
Silver      65
Name: Customer_Age, dtype: int64

#### Analyzing Categorical data

In [ ]:
bank['Attrition_Flag'].value_counts()

Attrition_Flag
Existing Customer    8500
Attrited Customer    1627
Name: count, dtype: int64

In [ ]:
bank["Gender"].value_counts()

Gender
F    5358
M    4769
Name: count, dtype: int64

In [ ]:
bank["Education_Level"].value_counts()

Education_Level
Graduate         3128
High School      2013
Unknown          1519
Uneducated       1487
College          1013
Post-Graduate     516
Doctorate         451
Name: count, dtype: int64

In [ ]:
bank["Marital_Status"].value_counts()

Marital_Status
Married     4687
Single      3943
Unknown      749
Divorced     748
Name: count, dtype: int64

- Changing the categorical variables into numerical values

In [ ]:
# this is the code for converting categorical variables which has only two categories
def ref1(x):
    if x=="M":
        return 1
    else:
        return 0
    
bank["Gender"] = bank["Gender"].map(ref1)

In [ ]:
def ref2(x):
    if x=="Existing Customer":
        return 1
    else:
        return 0
    
bank["Attrition_Flag"] = bank["Attrition_Flag"].map(ref2)

In [ ]:
y = bank['Card_Category'] # this is the target value
X = bank.copy()
X.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
0,768805383,1,45,0,3,High School,Married,$60K - $80K,Blue,39,...,1,3,12691.0,777,11914.0,1.335,1144,42,1.625,0.061
1,818770008,1,49,0,5,Graduate,Single,Less than $40K,Blue,44,...,1,2,8256.0,864,7392.0,1.541,1291,33,3.714,0.105
2,713982108,1,51,0,3,Graduate,Married,$80K - $120K,Blue,36,...,1,0,3418.0,0,3418.0,2.594,1887,20,2.333,0.000
3,769911858,1,40,0,4,High School,Unknown,Less than $40K,Blue,34,...,4,1,3313.0,2517,796.0,1.405,1171,20,2.333,0.760
4,709106358,1,40,0,3,Uneducated,Married,$60K - $80K,Blue,21,...,1,0,4716.0,0,4716.0,2.175,816,28,2.500,0.000

In [ ]:
bank['Income_Category'].value_counts()

Income_Category
Less than $40K    3561
$40K - $60K       1790
$80K - $120K      1535
$60K - $80K       1402
Unknown           1112
$120K +            727
Name: count, dtype: int64

In [ ]:
# this is the code for converting categorical variables which has more than two categories
from sklearn.preprocessing import LabelEncoder

def label_encoded(feat):
    le = LabelEncoder()
    le.fit(feat)
    print(feat.name, le.classes_)
    return le.transform(feat)

In [ ]:
X["Income_Category"]= label_encoded(X['Income_Category'])
X["Education_Level"]= label_encoded(X['Education_Level'])
X["Marital_Status"]= label_encoded(X['Marital_Status'])

X.head()

Income_Category ['$120K +' '$40K - $60K' '$60K - $80K' '$80K - $120K' 'Less than $40K'
 'Unknown']
Education_Level ['College' 'Doctorate' 'Graduate' 'High School' 'Post-Graduate'
 'Uneducated' 'Unknown']
Marital_Status ['Divorced' 'Married' 'Single' 'Unknown']

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
0,768805383,1,45,1,3,3,1,2,Blue,39,...,1,3,12691.0,777,11914.0,1.335,1144,42,1.625,0.061
1,818770008,1,49,0,5,2,2,4,Blue,44,...,1,2,8256.0,864,7392.0,1.541,1291,33,3.714,0.105
2,713982108,1,51,1,3,2,1,3,Blue,36,...,1,0,3418.0,0,3418.0,2.594,1887,20,2.333,0.000
3,769911858,1,40,0,4,3,3,4,Blue,34,...,4,1,3313.0,2517,796.0,1.405,1171,20,2.333,0.760
4,709106358,1,40,1,3,5,1,2,Blue,21,...,1,0,4716.0,0,4716.0,2.175,816,28,2.500,0.000

In [ ]:
X = X.drop(["CLIENTNUM","Card_Category"], axis = 1)

In [ ]:
from sklearn.decomposition import PCA
pca = PCA(n_components = 7)
pca2 = PCA(n_components=10)
pca_fit = pca.fit_transform(X)
pca_fit2 = pca2.fit_transform(X)

In [ ]:
X.shape

(10127, 19)

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.ensemble import RandomForestClassifier

In [ ]:
x_train,x_test,y_train, y_test = train_test_split(pca_fit2,y, test_size=0.2, random_state=42)

In [ ]:
random_model = RandomForestClassifier(n_estimators = 300, n_jobs = -1)

In [ ]:
# fitting the model
random_model.fit(x_train,y_train)

RandomForestClassifier(n_estimators=300, n_jobs=-1)

In [ ]:
#prediction 
y_pred = random_model.predict(x_test)

In [ ]:
# Accuracy on test data
random_model_acuracy_test = round(random_model.score(x_test,y_test),3)
print(random_model_acuracy_test )

0.954

In [ ]:
# Accuracy on train data
random_model_acuracy_train = round(random_model.score(x_train,y_train),3)
print(random_model_acuracy_train )

1.0

- Saving the model using Pickle

In [ ]:
import pickle

saved_model = pickle.dump(random_model, open('BankCards.pickle','wb'))
saved_pca = pickle.dump(pca2,open('BankCardsPCA.pickle','wb'))

#### NOTE
- So far, the model was built and trained. The accuracy w=of the model was also checked.
- Next, we have to create a django application and a virtual environment.
- Finally we habe to deploy the application to a Cloud Platform